lierda-iot/WizBlock/CODE/examples/rc_tank_demo/sdkconfig.defaults
# 遥控坦克 Demo 公共默认配置 (design.md 2.2 / 13)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# 分区表
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM: 大缓冲(JPEG/PCM/RGB565)分配用 (design.md 7.4/13)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=2048
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y

# WiFi: SoftAP(坦克) + STA(遥控器) 均需支持 (design.md 4.1)
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64

# 系统
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=16

# 角色默认为坦克(Kconfig choice 默认 RC_TANK_ROLE_TANK)。
# 切换遥控器角色: 构建时设 SDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.remote"
# 或 menuconfig 选择 Device Role。
